[
  {
    "id": "1767370377291",
    "title": "Training on mediation (ADR) was conducted for migrants from Ukraine",
    "date": "26/06/2024",
    "excerpt": "The seminar introduced mediation principles with a focus on family conflicts and children’s interests, combining theory, practical cases, and open discussion.",
    "content": "The seminar included the basics of mediation as an alternative way to resolve conflict situations, the basic principles of family mediation in which special attention was paid to the interests of children. Participants also immersed themselves in solving theoretical cases of conflict situations that will help to apply in practical life.\nAt the end there were answers to questions and discussion.",
    "slug": "training-on-mediation-adr-was-conducted-for-migrants-from-ukraine",
    "imageUrl": "/api/content/upload-1767370428102-67evpi6.jpg",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370004012",
    "title": "Helping Refugees Build a New Life",
    "date": "11/08/2025",
    "excerpt": "Our ministry helped Ukrainian and Russian refugees take meaningful steps toward stability by securing employment, safe housing, and hope for a dignified new beginning.",
    "content": "We are happy to share with you a wonderful success story from our ministry. Recently, our nonprofit was able to assist a Ukrainian refugee in finding a stable and well-paying job — a true step toward a new career and a brighter future.\n\nIn addition to employment support, we helped with lodging preparation to refugee from Russia, ensuring a safe and welcoming place to live during this important transition.\n\nMoments like these remind us why we serve — to provide guidance, practical help, encouragement, and Gospel hope to those starting over in a new country.\n\nYour prayers, support, and generosity make stories like this possible. Together, we can continue helping refugees rebuild their lives with dignity and purpose.\n\nGod Bless you!",
    "slug": "helping-refugees-build-a-new-life",
    "imageUrl": "",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767369485623",
    "title": "Building Stronger Families: Launching a Marriage Counseling Program for Refugees",
    "date": "28/12/2024",
    "excerpt": "The Slavic Emigrants Ministry launched a faith-based marriage counseling program for refugees to strengthen relationships using biblical principles and practical tools.",
    "content": "We are excited to announce that the Slavic Emigrants Ministry has launched a marriage counseling program tailored for refugees. Understanding the challenges of displacement, this program is designed to strengthen marriages and foster deeper connections through faith and understanding. Based on Bruce Wilkinson’s proven materials, the course focuses on six key components of a successful marriage as outlined in the Bible. Couples will gain practical tools for improving communication, building trust, resolving conflicts, and nurturing emotional and spiritual bonds. Strong marriages are the foundation of thriving families. This program aims to equip couples with the skills to grow together and rebuild their lives in a new environment. Join us in supporting this initiative and helping families create a stronger, more hopeful future.",
    "slug": "building-stronger-families-launching-a-marriage-counseling-program-for-refugees",
    "imageUrl": "/api/content/upload-1767369523551-sfh98jl.jpg",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767368136526",
    "title": "Meeting with the Los Angeles Slavic Refugee Community",
    "date": "15/12/2024",
    "excerpt": "SEM team met with Slavic refugees in Los Angeles to provide guidance on employment, community integration, and future planning as they build new lives in the U.S.",
    "content": "On December 14, 2024, the SEM team held several impactful meetings in Los Angeles with refugees from the former Soviet Union. These discussions focused on the challenges they face as they settle into life in the United States. The team provided guidance on critical areas such as securing employment, integrating into local communities, and planning for their future. This visit reflects SEM’s ongoing commitment to supporting Slavic refugees as they build new lives and establish themselves in their new home.",
    "slug": "meeting-with-the-los-angeles-slavic-refugee-community",
    "imageUrl": "/api/content/upload-1767368215684-n8f1eml.jpg",
    "imageUrl2": "/api/content/upload-1767368215688-8egbgsv.jpg",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370071361",
    "title": "Slavic immigrants ministry speaks against Russian invasion in Ukraine",
    "date": "18/11/2024",
    "excerpt": "The Slavic Emigrants Ministry supports democracy and human dignity in Russia while condemning the invasion of Ukraine and advocating for peace, justice, and unity.",
    "content": "The Slavic Emigrants Ministry actively stands in solidarity with the global movement for democracy in Russia, advocating for freedom, justice, and the voice of the people. At the same time, we firmly condemn the ongoing Russian invasion of Ukraine, recognizing the immense suffering and devastation it has caused. Our mission includes supporting efforts that promote peace, human dignity, and the unwavering hope for a future free from aggression and oppression. Together, we believe in the power of unity and the importance of standing up for what is right in these critical times.",
    "slug": "slavic-immigrants-ministry-speaks-against-russian-invasion-in-ukraine",
    "imageUrl": "/api/content/upload-1767370190556-eklycow.jpg",
    "imageUrl2": "/api/content/upload-1767370190560-zv2m5zn.jpg",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370217312",
    "title": "Driving Towards a Better Future: Helping a Ukrainian Family in Need",
    "date": "31/10/2024",
    "excerpt": "SEM supported a Ukrainian family fleeing war by providing a car, offering stability, hope, and a fresh start in safety and peace.",
    "content": "The Slavic Emigrants Ministry was honored to support a Ukrainian family who recently arrived, fleeing the devastating impacts of war. Understanding their urgent need for reliable transportation to manage daily life and care for their children, we were able to provide them with a car. This small yet impactful gesture represents hope, stability, and a fresh start for this resilient family as they navigate their new life in safety and peace. Together, we continue to make a difference, one family at a time.",
    "slug": "driving-towards-a-better-future-helping-a-ukrainian-family-in-need",
    "imageUrl": "/api/content/upload-1767370316596-ubkiu9s.jpg",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370318965",
    "title": "Prayer, discussion and food",
    "date": "12/09/2024",
    "excerpt": "The Slavic Emigrants Ministry builds community for immigrants through regular faith-centered gatherings that offer spiritual support, fellowship, and a sense of belonging.",
    "content": "The Slavic Emigrants Ministry is dedicated to providing a welcoming and supportive environment for immigrants by organizing weekly and monthly gatherings that combine spiritual support, meaningful discussions, prayer, and a shared meal. These events serve as a vital space for individuals to connect with one another, share their experiences, and find encouragement in a friendly and faith-centered atmosphere. By fostering a sense of belonging and community, the ministry helps immigrants navigate their new lives while building relationships that transcend cultural and linguistic differences. Each gathering is not only an opportunity for spiritual growth but also a chance to enjoy heartfelt conversations and the warmth of fellowship over delicious food.",
    "slug": "prayer-discussion-and-food",
    "imageUrl": "/api/content/upload-1767370371766-aev0mf7.jpg",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370432557",
    "title": "Friends of Bellevue Cross-Cultural Center and Slavic Emigrants Ministry",
    "date": "21/05/2024",
    "excerpt": "The Slavic Emigrants Ministry and community partners launched inclusive cultural events in Bellevue, bringing diverse residents together to celebrate diversity, build connections, and strengthen a shared sense of belonging.",
    "content": "The Slavic Emigrants Ministry team, in collaboration with the Friends of Bellevue Cross-Cultural Center, successfully launched a series of events celebrating the spirit of cultural diversity and inclusion in our community. These gatherings, which drew over 100 participants, reflected Bellevue’s commitment to fostering connections among people of different backgrounds through shared experiences of joy, encouragement, and learning.\n\nThis effort aligns closely with the goals of the newly launched Cross-Cultural Center initiative in Bellevue, championed by Councilmember Conrad Lee. As Bellevue embraces its role as a home for people from around the world—where 40% of the population are immigrants—initiatives like these are essential in creating opportunities for cross-cultural interactions. By bringing people together through food, art, music, games, and education, the events served as a platform to build meaningful relationships and a stronger sense of belonging within our community.\n\nThe success of these events also highlights the collaborative vision of organizations like the Friends of Bellevue Cross-Cultural Center, who aim to unite communities and create a welcoming environment where differences are celebrated and mutual understanding is cultivated. This milestone is a step toward realizing Bellevue’s vision for a future where cultural diversity is not just acknowledged but embraced as a foundation for unity and progress.",
    "slug": "friends-of-bellevue-cross-cultural-center-and-slavic-emigrants-ministry",
    "imageUrl": "/api/content/upload-1767370489413-q2225qk.jpg",
    "imageUrl2": "/api/content/upload-1767370489415-9oxp7oq.jpg",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370492657",
    "title": "Providing Hope on Wheels: Supporting a Ukrainian Family in Need",
    "date": "03/04/2024",
    "excerpt": "The Slavic Emigrants Ministry supported a Ukrainian family with hearing impairments by providing a vehicle, offering hope, mobility, and stability as they rebuild their lives after war.",
    "content": "The Slavic Emigrants Ministry had the privilege of helping a family with hearing impairments who fled Ukraine to escape the horrors of war. Through the generosity of our community and dedicated efforts, we were able to provide them with a reliable vehicle, ensuring they have a crucial means of transportation as they navigate their new life. This small act of kindness symbolizes hope and support for those who have endured unimaginable hardships, and it reflects our commitment to standing with families in need during challenging times. Together, we can make a difference, one step at a time.",
    "slug": "providing-hope-on-wheels-supporting-a-ukrainian-family-in-need",
    "imageUrl": "/api/content/upload-1767370538829-gpt6lbw.jpg",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  },
  {
    "id": "1767370540875",
    "title": "SEM launches debt relief courses",
    "date": "19/03/2024",
    "excerpt": "SEM has launched a Financial Literacy Initiative.",
    "content": "SEM Launches Financial Literacy Initiative: Recognizing the importance of financial stability in immigrant integration, SEM has launched a Financial Literacy Initiative. Through workshops, seminars, and one-on-one counseling sessions, immigrants will gain essential knowledge and skills in personal finance management, debt relief strategies, and wealth building, empowering them to achieve greater economic independence and security in their new lives in the US.",
    "slug": "sem-launches-debt-relief-courses",
    "imageUrl": "",
    "imageUrl2": "",
    "videoUrl": "",
    "externalLink": "",
    "externalLinkTitle": "",
    "externalLinkDescription": "",
    "externalLinkImage": ""
  }
]